/***********************************************************************
 * @file camera.h
 * CAMERA
 * @author	:	ch
 * @brief	:	
 * @version:	v1.0
 * @Copyright (C)  2020-12-24  .cdWFVCEL. all right reserved
***********************************************************************/

#ifndef __CAMERA_H_
#define __CAMERA_H_
/* 包含头文件 ------------------------------------------------------------------*/
#include "ch/bsp.h"
/* 宏定义 ----------------------------------------------------------------------*/
#define FILE_PHOTO "/photo.jpg"
#define PICBUF_SIZE (40 * 1024)
/* 类型定义 --------------------------------------------------------------------*/
typedef struct PIC
{
    char buf[PICBUF_SIZE] = {0};
    u32 length;
};
/* 变量声明 --------------------------------------------------------------------*/
extern PIC picture;
/* 函数声明 --------------------------------------------------------------------*/
void CAMERA_Init();
u8 CAMERA_CapturePhotoSaveSpiffs(void);
#endif // __CAMERA_H_
